//;******************************************************************************
//;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; 
//; Module Name:
//; 
//;   SecureOptionRomControlSetup.uni
//; 
//; Abstract:
//; 
//;   Strings for Secure Option Rom Control Setup
//; 

/=#

#include "Standard.uni"

#string STR_SECURE_OPTION_ROM_CONTROL_FORMSET        #language en-US        "Secure Option ROM Control"
                                                     #language fr-FR        "Secure Option ROM Control"
                                                     #language zh-TW        "Secure Option ROM Control"
                                                     #language ja-JP        "Secure Option ROM Control"
                                                     #language it-IT        "Secure Option ROM Control"
                                                     #language es-ES        "Secure Option ROM Control"
                                                     #language de-DE        "Secure Option ROM Control"
                                                     #language pt-PT        "Secure Option ROM Control"
#string STR_SECURE_OPTION_ROM_CONTROL_FORMSET_HELP   #language en-US        "Secure Option ROM Control"
                                                     #language fr-FR        "Secure Option ROM Control"
                                                     #language zh-TW        "Secure Option ROM Control"
                                                     #language ja-JP        "Secure Option ROM Control"
                                                     #language it-IT        "Secure Option ROM Control"
                                                     #language es-ES        "Secure Option ROM Control"
                                                     #language de-DE        "Secure Option ROM Control"
                                                     #language pt-PT        "Secure Option ROM Control"
													 
#string STR_BLANK_STRING                #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "												
#string STR_SECURE_OPTION_ROM_CONTROL   #language en-US        "Secure Option ROM Control"
                                        #language fr-FR        "Secure Option ROM Control"
                                        #language zh-TW        "Secure Option ROM Control"
                                        #language ja-JP        "Secure Option ROM Control"
                                        #language it-IT        "Secure Option ROM Control"
                                        #language es-ES        "Secure Option ROM Control"
                                        #language de-DE        "Secure Option ROM Control"
                                        #language pt-PT        "Secure Option ROM Control"
                                        
#string STR_SECURE_OPTION_ROM_HELP      #language en-US        "These items control various Option ROM policy"
                                        #language fr-FR        "These items control various Option ROM policy"
                                        #language zh-TW        "These items control various Option ROM policy"
                                        #language ja-JP        "These items control various Option ROM policy"
                                        #language it-IT        "These items control various Option ROM policy"
                                        #language es-ES        "These items control various Option ROM policy"
                                        #language de-DE        "These items control various Option ROM policy"
                                        #language pt-PT        "These items control various Option ROM policy"   
#string FUNCTION_NINE_STRING            #language en-US        "F9=Reset to Defaults"
                                        #language fr-FR        "F9=Reset à Défauts"
#string FUNCTION_TEN_STRING             #language en-US        "F10=Save"
                                        #language fr-FR        "F10=Économiser"										

#string STR_DEFAULT_OPTION_ROM_POLICY_TEXT      #language en-US        "Default Setup Option ROM policy"
                                                #language fr-FR        "Default Setup Option ROM policy"
                                                #language zh-TW        "Default Setup Option ROM policy"
                                                #language ja-JP        "Default Setup Option ROM policy"
                                                #language it-IT        "Default Setup Option ROM policy"
                                                #language es-ES        "Default Setup Option ROM policy"
                                                #language de-DE        "Default Setup Option ROM policy"
                                                #language pt-PT        "Default Setup Option ROM policy"
#string STR_DEFAULT_OPTION_ROM_POLICY_HELP      #language en-US        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language fr-FR        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language zh-TW        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language ja-JP        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language it-IT        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language es-ES        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language de-DE        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
                                                #language pt-PT        "Select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed."
#string STR_ON_BOARD_DEFAULT_OPTION_ROM_POLICY_TEXT      #language en-US        "On Board Default Setup Option ROM policy"
                                                         #language fr-FR        "On Board Default Setup Option ROM policy"
                                                         #language zh-TW        "On Board Default Setup Option ROM policy"
                                                         #language ja-JP        "On Board Default Setup Option ROM policy"
                                                         #language it-IT        "On Board Default Setup Option ROM policy"
                                                         #language es-ES        "On Board Default Setup Option ROM policy"
                                                         #language de-DE        "On Board Default Setup Option ROM policy"
                                                         #language pt-PT        "On Board Default Setup Option ROM policy"
#string STR_ON_BOARD_DEFAULT_OPTION_ROM_POLICY_HELP      #language en-US        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language fr-FR        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language zh-TW        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language ja-JP        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language it-IT        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language es-ES        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language de-DE        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."
                                                         #language pt-PT        "Use for on board device to select default Option ROM policy that BIOS will use this policy to determine which type of option ROM can be executed. Graphics device option ROM will allow to load by default."

#string STR_ALL_TEXT                    #language en-US        "All"
                                        #language fr-FR        "All"
                                        #language zh-TW        "All"
                                        #language ja-JP        "All"
                                        #language it-IT        "All"
                                        #language es-ES        "All"
                                        #language de-DE        "All"
                                        #language pt-PT        "All"
#string STR_LEGACY_ROM_TEXT             #language en-US        "Legacy ROM"
                                        #language fr-FR        "Legacy ROM"
                                        #language zh-TW        "Legacy ROM"
                                        #language ja-JP        "Legacy ROM"
                                        #language it-IT        "Legacy ROM"
                                        #language es-ES        "Legacy ROM"
                                        #language de-DE        "Legacy ROM"
                                        #language pt-PT        "Legacy ROM"
#string STR_UNSIGNED_EFI_ROM_TEXT       #language en-US        "Unsigned UEFI ROM"
                                        #language fr-FR        "Unsigned UEFI ROM"
                                        #language zh-TW        "Unsigned UEFI ROM"
                                        #language ja-JP        "Unsigned UEFI ROM"
                                        #language it-IT        "Unsigned UEFI ROM"
                                        #language es-ES        "Unsigned UEFI ROM"
                                        #language de-DE        "Unsigned UEFI ROM"
                                        #language pt-PT        "Unsigned UEFI ROM"
#string STR_SIGNED_EFI_ROM_TEXT         #language en-US        "Signed UEFI ROM"
                                        #language fr-FR        "Signed UEFI ROM"
                                        #language zh-TW        "Signed UEFI ROM"
                                        #language ja-JP        "Signed UEFI ROM"
                                        #language it-IT        "Signed UEFI ROM"
                                        #language es-ES        "Signed UEFI ROM"
                                        #language de-DE        "Signed UEFI ROM"
                                        #language pt-PT        "Signed UEFI ROM"  
#string STR_OPTION_ROM_LIST_TITLE       #language en-US        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language fr-FR        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language zh-TW        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language ja-JP        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language it-IT        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language es-ES        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language de-DE        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"
                                        #language pt-PT        "\nOpROM List: VendorID - DeviceID (Active/Inactive)"  										
#string STR_OPTION_ROM_POLICY_HELP      #language en-US        "Option ROM policy for this Device:"
                                        #language fr-FR        "Option ROM policy for this Device:"
                                        #language zh-TW        "Option ROM policy for this Device:"
                                        #language ja-JP        "Option ROM policy for this Device:"
                                        #language it-IT        "Option ROM policy for this Device:"
                                        #language es-ES        "Option ROM policy for this Device:"
                                        #language de-DE        "Option ROM policy for this Device:"
                                        #language pt-PT        "Option ROM policy for this Device:"                                                          
#string STR_DELETE_POLICY_STRING        #language en-US        "Delete this Option ROM policy"
                                        #language fr-FR        "Delete this Option ROM policy"
                                        #language zh-TW        "Delete this Option ROM policy"
                                        #language ja-JP        "Delete this Option ROM policy"
                                        #language it-IT        "Delete this Option ROM policy"
                                        #language es-ES        "Delete this Option ROM policy"
                                        #language de-DE        "Delete this Option ROM policy"
                                        #language pt-PT        "Delete this Option ROM policy"
#string STR_DELETE_OPROM_POLICY_STRING  #language en-US        "  Delete Option ROM policy"
                                        #language fr-FR        "  Delete Option ROM policy"
                                        #language zh-TW        "  Delete Option ROM policy"
                                        #language ja-JP        "  Delete Option ROM policy"
                                        #language it-IT        "  Delete Option ROM policy"
                                        #language es-ES        "  Delete Option ROM policy"
                                        #language de-DE        "  Delete Option ROM policy"
                                        #language pt-PT        "  Delete Option ROM policy"	
#string STR_DELETE_OPROM_POLICY_HELP    #language en-US        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language fr-FR        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language zh-TW        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language ja-JP        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language it-IT        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language es-ES        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language de-DE        "Delete Option ROM policy with Vendor ID and Device ID."
                                        #language pt-PT        "Delete Option ROM policy with Vendor ID and Device ID." 
#string STR_DELETE_OPROM_POLICY_DIAG    #language en-US        "Select Option ROM policy to delete."
                                        #language fr-FR        "Select Option ROM policy to delete."
                                        #language zh-TW        "Select Option ROM policy to delete."
                                        #language ja-JP        "Select Option ROM policy to delete."
                                        #language it-IT        "Select Option ROM policy to delete."
                                        #language es-ES        "Select Option ROM policy to delete."
                                        #language de-DE        "Select Option ROM policy to delete."
                                        #language pt-PT        "Select Option ROM policy to delete." 
										
#string STR_AUTO_TEXT                           #language en-US        "Auto"
                                                #language fr-FR        "Auto"
                                                #language zh-TW        "Auto"
                                                #language ja-JP        "Auto"
                                                #language it-IT        "Auto"
                                                #language es-ES        "Auto"
                                                #language de-DE        "Auto"
                                                #language pt-PT        "Auto"
#string STR_NONE_TEXT                           #language en-US        "None"
                                                #language fr-FR        "None"
                                                #language zh-TW        "None"
                                                #language ja-JP        "None"
                                                #language it-IT        "None"
                                                #language es-ES        "None"
                                                #language de-DE        "None"
                                                #language pt-PT        "None"
#string STR_ADD_NEW_OPTION_ROM_POLICY_TEXT      #language en-US        "  Add New Option ROM policy"
                                                #language fr-FR        "  Add New Option ROM policy"
                                                #language zh-TW        "  Add New Option ROM policy"
                                                #language ja-JP        "  Add New Option ROM policy"
                                                #language it-IT        "  Add New Option ROM policy"
                                                #language es-ES        "  Add New Option ROM policy"
                                                #language de-DE        "  Add New Option ROM policy"
                                                #language pt-PT        "  Add New Option ROM policy" 
#string STR_ADD_NEW_OPTION_ROM_POLICY_HELP      #language en-US        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language fr-FR        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language zh-TW        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language ja-JP        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language it-IT        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language es-ES        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language de-DE        "Add New Option ROM policy with Vendor ID and Device ID."
                                                #language pt-PT        "Add New Option ROM policy with Vendor ID and Device ID." 												
#string STR_NAME_VALUE_VAR_NAME0                #language en-US        "MyNameValue0"
                                                #language fr-FR        "MyNameValue0"
                                                #language zh-TW        "MyNameValue0"
                                                #language ja-JP        "MyNameValue0"
                                                #language it-IT        "MyNameValue0"
                                                #language es-ES        "MyNameValue0"
                                                #language de-DE        "MyNameValue0"
                                                #language pt-PT        "MyNameValue0"